<html><head><title>Journees de Geometrie Algorithmique 2005</title></head>
<body bgcolor="#efefff" link="#008b8b" alink="red" vlink="#696969" marginheight="5">



<p>
<table cellspacing="0" cellpadding="5">
<tbody><tr><td bgcolor="green">
<font color="#ffffa1"><b>David Cohen-Steiner, INRIA Sophia-Antipolis,
<br> Persistance topologique</b></font>
</td></tr>
</tbody></table>

</p><p><b>Résumé</b>
</p><p align="justify">
La persistance topologique, introduite par H. Edelsbrunner,
D. Letscher et A. Zomorodian en 2000, est un moyen de distinguer le
 "signal"  du "bruit" dans une fonction r&#233;elle <IMG
 WIDTH="13" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="img1.png"
 ALT="$f$"> d&#233;finie sur
un espace topologique. L'id&#233;e de la persistance est d'analyser
l'&#233;volution de la topologie des sous-ensembles de niveau
<!-- MATH
 $f^{-1}(-\infty,x]$
 -->
<IMG
 WIDTH="85" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img2.png"
 ALT="$f^{-1}(-\infty,x]$"> de <IMG
 WIDTH="13" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="img1.png"
 ALT="$f$">, lorsque le seuil <IMG
 WIDTH="12" HEIGHT="13" ALIGN="BOTTOM" BORDER="0"
 SRC="img3.png"
 ALT="$x$"> augmente. Il se
trouve que cette &#233;volution peut &#234;tre repr&#233;sent&#233;e sous la
forme d'un ensemble d'intervalles, appel&#233;s <I>intervalles de
persistance</I>. Chacun de ces intervalles correspond &#224; la "dur&#233;e de
vie" d'un &#233;v&#233;nement topologique dans l'&#233;volution des
sous-ensembles de niveau de <IMG
 WIDTH="13" HEIGHT="30" ALIGN="MIDDLE" BORDER="0"
 SRC="img1.png"
 ALT="$f$">. Une propri&#233;t&#233; importante de la
persistance est sa stabilit&#233; vis-&#224;-vis des perturbations. Ainsi,
ajouter un bruit de faible amplitude &#224; une fonction r&#233;elle aura
pour effet d'introduire ou de supprimer des intervalles courts, sans
trop modifier les intervalles longs. Les intervalles longs peuvent
donc &#234;tre consid&#233;r&#233;s comme relevant du signal et non du bruit.
<P>
<br>
La premi&#232;re partie de ce cours sera consacr&#233;e &#224; la d&#233;finition
de la persistance topologique. Puis je donnerai un algorithme simple
permettant de calculer les intervalles de persistance d'une fonction
lin&#233;aire par morceaux d&#233;finie sur un complexe simplicial. Enfin,
je d&#233;crirai quelques applications g&#233;om&#233;triques de la
propri&#233;t&#233; de stabilit&#233; de la persistance.
</p></body></html>